// ....................JavaScript Core part from begginers.................

// .....Swap variable without temp.....
// ধরুন আপনার কাছে দুটি বাটি আছে । প্রথম বাটিতে জুস রাখা আর দ্বিতীয় বাটিতে পানি রাখা আছে । 
// এখন প্রথম বাটির জুস দ্বিতীয় বাটিতে রাখতে হবে কিন্তু জুস যাতে পানির সাথে না মিশে যায় । সেজন্য আপনাকে তৃতীয় কোন বাটি নিতে হবে পানির বাটি খালি করার জন্য। 
// তৃতীয় বাটিতে পানি ঢেলে সেই পানির বাটিতে জুস রাখতে হবে । এখানে তৃতীয় বাটিই হচ্ছে Swap 

console.log("...........Swap variable without temp...........");
var a = 7;
var b = 5;
console.log("Before Swap: a =", a, "b =", b);
var temp = a;  //.................................এটা হচ্ছে তৃতীয় বাটি 
a = b;
b = temp;
console.log("After Swap: a =", a, "b =", b);



